app/controllers/api/v1/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("user_id", "title", "content", "created_at", "updated_at", "coin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def remove
    @article = User.get_article(params[:user_id], params[:url])
    @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 13]]