app/controllers/api/v1/cryptos_controller.rb

SELECT "cryptos".* FROM "cryptos"
SELECT  "cryptos".* FROM "cryptos" ORDER BY "cryptos"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "cryptos" ("name", "price", "ticker", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bitcoin"], ["price", 10693], ["ticker", "BTC"], ["created_at", "2019-07-02 18:19:03.970024"], ["updated_at", "2019-07-02 18:19:03.970024"]]
---
  def index
    @cryptos = Crypto.all
    if @cryptos.last.updated_at.to_s.slice(0,10) != Time.now.strftime("%F %T").to_s.slice(0,10)
      APICall.get_data.each_value{|data| Crypto.create(data)}