app/controllers/api/v1/transactions_controller.rb

INSERT INTO "transactions" ("user_id", "crypto_id", "quantity", "coin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["crypto_id", 61], ["quantity", 4.6], ["coin", "Bitcoin"], ["created_at", "2019-07-03 16:58:42.473983"], ["updated_at", "2019-07-03 16:58:42.473983"]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    if @transaction.save

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def find_transaction
    @transaction = Transaction.find(params[:id])