app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Nick Moore"], ["email", "nick@yahoo.com"], ["password", "password"], ["created_at", "2019-07-02 15:08:25.483824"], ["updated_at", "2019-07-02 15:08:25.483824"]]

  def login
    email = params[:email]
    password = params[:password]
    @user = User.all.find_by(email: email, password: password)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "nick@yahoo.com"], ["password", "dsfds"], ["LIMIT", 1]]

  def delete_user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]