app/models/crypto.rb

SELECT  "cryptos".* FROM "cryptos" ORDER BY "cryptos"."id" DESC LIMIT $1  [["LIMIT", 70]]
---
  def self.get_week_data
    Crypto.all.last(70).group_by{|obj|obj.name}