app/models/transaction.rb

  def self.get_user_coins(id)
    transHash = Transaction.all.where(user_id: id).group_by {|trx| Crypto.find(trx.crypto_id).name}
    mycurrencies = {}
    transHash.each do |name, values|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]
SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]