app/models/user.rb

  def self.get_article(user_id, url)
    user = User.find(user_id)
    user.articles.find{|article| article.url == url}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]